Revit 2027 API
SweptProfile.GetSweptProfile Method
 Returns an object that describes the profile that is swept along the driving curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Profile GetSweptProfile()
Public Function GetSweptProfile As Profile
public:
Profile^ GetSweptProfile()
member GetSweptProfile : unit -> Profile
Return Value
Profile
 A geometric profile object.
Remarks
 The profile is swept perpendicular to the driving curve.
See Also
Reference
SweptProfile Class
Autodesk.Revit.DB Namespace